nc: 1
scale: n

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3x, [512, False]]        # 4, directional texture enhancement
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]        # 6
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]          # 9
  - [-1, 2, C2PSA, [1024]]            # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12
  - [-1, 2, C3k2, [512, False]]                  # 13, P4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15
  - [-1, 2, C3k2, [256, False]]                  # 16, P3
  - [-1, 1, TFCM, [256, 9, 9, 16]]               # 17, P3 enhanced by TFCM

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 13], 1, Concat, [1]]                   # 19
  - [-1, 2, C3k2, [512, False]]                  # 20, P4 refined

  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 10], 1, Concat, [1]]                   # 22
  - [-1, 2, C3k2, [1024, True]]                  # 23, P5 refined

  - [[17, 20, 23], 1, Detect, [nc]]              # Detect(P3, P4, P5)
